src/DataProcessors/РегистрацияРелиза/РегистрацияРелиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РегистрацияРелиза</name>
</mdclass:DataProcessor>

src/Documents/Релиз/Релиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Релиз</name>
  <registerRecords>InformationRegister.Релизы</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРелиза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>База</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolsWorld</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Aelita</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКонфигурация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРазработки</name>
    <attributes>
      <name>ОбъектРазработки</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияОбъектаРазработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Слияния</name>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Версии</name>
    <attributes>
      <name>ОбъектРазработки</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКоммита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗадачиРелиза</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Постановщик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПользователей</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ТокенGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиторияНаШаре</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаПользователяGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТимЛид</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПользователяGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDПользователяBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автотрудозатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <predefined>
    <items>
      <name>Неопределен</name>
      <description>Неопределен</description>
    </items>
  </predefined>
  <attributes>
    <name>URLGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПроектаGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PathGitClone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимыРаботыКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСборкиРелиза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевШара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьКонфигурациюВРелиз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяJobJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаАктуальныхОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляАктуализацииОбработок</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаРасширенийДляАктуализацииОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРепозитория</name>
    <type>
      <types>EnumRef.ТипРепозитория</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/РегистрацияРелиза/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьПоследниеСлиянияНаСервере()
	
	ИДПроекта = Проект.ИДПроектаGitLab;
	URLGitLab = Проект.URLGitLab;
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("target_branch", "main");
	ПараметрыЗапроса.Вставить("order_by", "updated_at");
	ПараметрыЗапроса.Вставить("sort", "desc");
	ПараметрыЗапроса.Вставить("per_page", 60);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("PRIVATE-TOKEN", НастройкиПользователя.ТокенGitLab);
	Заголовки.Вставить("content-type", "application/json");

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПроверятьSSL" , Ложь);	
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);
	
	ЮрлПоискМерджРеквестов = СтрШаблон("%1/api/v4/projects/%2/merge_requests", URLGitLab, ИДПроекта);

	МерджРеквесты = КоннекторHTTP.GetJson(ЮрлПоискМерджРеквестов, ПараметрыЗапроса, ДополнительныеПараметры);
	ЗаполнитьТаблицуСлияний(МерджРеквесты);
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСлияний(МерджРеквесты)
	
	Для Каждого Элемент Из МерджРеквесты Цикл
		НоваяСтрока = ТаблицаСлияний.Добавить(); 
		НоваяСтрока.Номер = Элемент["iid"];
		НоваяСтрока.Название = Элемент["title"];
		НоваяСтрока.URL = Элемент["web_url"];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПоследниеСлияния(Команда)
	Если ПроверитьЗаполнение() Тогда
		ПолучитьПоследниеСлиянияНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСлиянийПриАктивизацииСтроки(Элемент)
	
	ИзмененыеОбъекты.Очистить();
	ТекущийМерджДанные = Элементы.ТаблицаСлияний.ТекущиеДанные;
	НомераМерджРеквестов.Очистить();
	
	Если ТекущийМерджДанные <> Неопределено Тогда
		НомераМерджРеквестов = НомераВыделенныхМерджРеквестов();
		ИзмененыеОбъекты.Очистить();
		ПодключитьОбработчикОжидания("ЗаполнитьСписокИзмененыхОбъектов", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НомераВыделенныхМерджРеквестов()
	
	ВыделенныеСтроки = Элементы.ТаблицаСлияний.ВыделенныеСтроки;
	
	Для Каждого ИндексСтроки Из ВыделенныеСтроки Цикл
		СтрокаМерджРеквеста = Элементы.ТаблицаСлияний.ДанныеСтроки(ИндексСтроки);
		НомераМерджРеквестов.Добавить(СтрокаМерджРеквеста.Номер, СтрокаМерджРеквеста.Номер);
	КонецЦикла;

	Возврат НомераМерджРеквестов;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокИзмененыхОбъектов() Экспорт
		
	Для Каждого НомерМерджРеквеста Из НомераМерджРеквестов Цикл
		ЗаполнитьСписокИзмененыхОбъектовНаСервере(НомерМерджРеквеста.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИзмененыхОбъектовНаСервере(НомерМерджРеквеста)
	
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	НастройкиПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Проект, "URLGitLab, ИДПроектаGitLab");
	
	СписокКоммитов = РаботаСGitLab.СписокКоммитовПоМерджРеквесту(НастройкиПроекта.URLGitLab,
		НастройкиПроекта.ИДПроектаGitLab,
		НомерМерджРеквеста,
		НастройкиПользователя.ТокенGitLab
	);
	
	ТаблицаИзмененныхОбъектов = РаботаСGitLab.ИзмененияПоКоммиту(НастройкиПроекта.URLGitLab,
		НастройкиПроекта.ИДПроектаGitLab,
		НомерМерджРеквеста,
		НастройкиПользователя.ТокенGitLab,
		СписокКоммитов
	);
	
	Для Каждого СтрокаТаблицыЗначенийИзмененныеОбъекты Из ТаблицаИзмененныхОбъектов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицыЗначенийИзмененныеОбъекты.ТипОбъекта) Тогда
			Продолжить;	
		КонецЕсли;	
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Объект", СтрокаТаблицыЗначенийИзмененныеОбъекты.Объект);
		
		СтрокиИзмененныеОбъекты = ИзмененыеОбъекты.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиИзмененныеОбъекты.Количество() = 0 Тогда
			СтрокаИзмененныеОбъекты = ИзмененыеОбъекты.Добавить();
		Иначе
			СтрокаИзмененныеОбъекты = СтрокиИзмененныеОбъекты[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаИзмененныеОбъекты, СтрокаТаблицыЗначенийИзмененныеОбъекты,, "ИнформацияОВерсии");
		Если ПустаяСтрока(СтрокаИзмененныеОбъекты.ИнформацияОВерсии) Тогда
			ИнформацияОВерсии = Новый Соответствие;
		Иначе
			ИнформацияОВерсии = ОбщегоНазначения.JSONВЗначение(СтрокаИзмененныеОбъекты.ИнформацияОВерсии);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ИнформацияОВерсии, 
			СтрокаТаблицыЗначенийИзмененныеОбъекты.ИнформацияОВерсии, Истина
		);
		
		СтрокаИзмененныеОбъекты.ИнформацияОВерсии = ОбщегоНазначения.ЗначениеВJSON(ИнформацияОВерсии); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументРелизаНаСервере(ТекстНомерРелиза)

	ДанныеКРелизу = ДанныеКРелизу();
	ДанныеКРелизу.Вставить("Проект", Проект);
	ДанныеКРелизу.Вставить("НомерРелиза", ТекстНомерРелиза);
	ДанныеКРелизу.Вставить("Дата", ТекущаяДатаСеанса());

	Возврат Документы.Релиз.СоздатьДокументРелиза(ДанныеКРелизу);
	
КонецФункции


&НаСервере
Функция ДанныеКРелизу()

	ДанныеКРелизу = Новый Структура;
	ОбъектыРазработки = НовыйОбъектыРазработки();
	
	Для Каждого Элемент Из ИзмененыеОбъекты Цикл
		Если ПустаяСтрока(Элемент.ТипОбъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Элемент.ТипОбъекта = "ВнешняяОбработка" Тогда
			ИмяВнешнейОбработки = СтрЗаменить(Элемент.Объект, "Внешние обработки.", "");
			ОбъектыРазработкиСсылка = Справочники.ОбъектыРазработки.НайтиПоНаименованию(ИмяВнешнейОбработки, Истина,, Проект);
			НоваяСтрока = ОбъектыРазработки.Добавить();
			НоваяСтрока.Название = ИмяВнешнейОбработки; 
			НоваяСтрока.ОбъектРазработки = ОбъектыРазработкиСсылка; 
			НоваяСтрока.ИнформацияОВерсии = Элемент.ИнформацияОВерсии;
		Иначе
			ДанныеКРелизу.Вставить(Элемент.ТипОбъекта, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбъектыРазработки.Количество() Тогда
		ДанныеКРелизу.Вставить("ОбъектыРазработки", ОбъектыРазработки);
	КонецЕсли;

	Возврат ДанныеКРелизу;
	
КонецФункции

Функция НовыйОбъектыРазработки()

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("ОбъектРазработки", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРазработки"));
	ТаблицаОбъектов.Колонки.Добавить("Название");
	ТаблицаОбъектов.Колонки.Добавить("ВерсияОбъектаРазработки");
	ТаблицаОбъектов.Колонки.Добавить("ИнформацияОВерсии");
	
	Возврат ТаблицаОбъектов;
	
КонецФункции

&НаКлиенте
Асинх Процедура ЗарегистрироватьНовыйРелиз(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Документ = СоздатьДокументРелизаНаСервере(НомерРелиза);
	Обещание = ОткрытьЗначениеАсинх(Документ);
	//Результат = Ждать Обещание; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаСлияниеИзДевелопаВМейн(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	СоздатьЗаявкуНаСлияниеИзДевелопаВМейнНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаСлияниеИзДевелопаВМейнНаСервере()
	
	НастройкиПроекта = Справочники.Проекты.НастройкиПроекта(Проект);
	
	ДанныеМерджРеквеста = РаботаСGitLab.НовыйДанныеМерджРеквеста();
	
	ДанныеМерджРеквеста.id = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "ИДПроектаGitLab");
	ДанныеМерджРеквеста.source_branch = "develop";
	ДанныеМерджРеквеста.target_branch = "main";
	ДанныеМерджРеквеста.title = НомерРелиза;
	ДанныеМерджРеквеста.description = НомерРелиза;
	
	РаботаСGitLab.СоздатьМерджРеквест(НастройкиПроекта.URLGitLab,
		НастройкиПроекта.ИДПроектаGitLab,
		ОбщегоНазначенияУправлениеРазработкой.ЗначениеПоКлючу("TokenConnectionGitLab"),
		ДанныеМерджРеквеста
	);	
	
КонецПроцедуры
